app/views/gossip/show.html.erb

</p>
<%= Gossip.all.each do |gossip|%>
    <% if gossip.user == User.find(session[:current_user_id])%>
---
SELECT "gossips".* FROM "gossips"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]