app/controllers/gossip_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def create
        puts "create"
        @gossip = Gossip.new
        @gossip.title = params[:title]
        @gossip.content = params[:content]
        @gossip.user = User.find(session[:current_user_id])