app/controllers/gossip_controller.rb

SELECT "gossips".* FROM "gossips"
---
    def index
        puts "index"
        @gossips = Gossip.all

SELECT "gossips".* FROM "gossips"
---
    def show
        puts "show"
        @gossips = Gossip.all

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
    def new
    puts "new"
      @gossip = Gossip.find(session[:current_user_id])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "ccc"], ["content", "cccccc"], ["user_id", 1], ["created_at", "2018-11-01 21:41:49.975539"], ["updated_at", "2018-11-01 21:41:49.975539"]]
---
    def create
        puts "create"
        @gossip = Gossip.new
        @gossip.title = params[:title]
        @gossip.content = params[:content]
        @gossip.user = User.find(session[:current_user_id])
        @gossip.save

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."user_id" = $1 LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 2]]
---
    def destroy
        puts "des"
        puts params
        @gossip = Gossip.find_by(user: session[:current_user_id])
        @gossip.destroy