app/controllers/registrations_controller.rb

    def index
        @gossips = Gossip.all
---
SELECT "gossips".* FROM "gossips"

    def create
        @user = User.new
        @user.name = params[:name]
        @user.email = params[:email]
        @user.password = params[:password]
        @user.save
---
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "salim"], ["email", "a@a.a"], ["password", "a"], ["created_at", "2018-11-01 10:35:41.942154"], ["updated_at", "2018-11-01 10:35:41.942154"]]

    def connexion
        @user_email = User.find_by(email: params[:email])
        @user_password = User.find_by(password: params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "a@a.a"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."password" = $1 LIMIT $2  [["password", ""], ["LIMIT", 1]]